In [15]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([4, 7,-5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [9]:
obj2['d'] =6

In [10]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2[obj2<0]

a   -5
dtype: int64

In [12]:
obj2 * 3

d    18
b    21
a   -15
c     9
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'ohio': 35000, 'Texas': 71000, 'Oregon':16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
pd.isnull(obj4)

California     True
ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj4.isnull()

California     True
ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj4.notnull()

California    False
ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Oregon         32000.0
Texas         142000.0
Utah               NaN
ohio           70000.0
dtype: float64

In [30]:
obj4.name = 'population'
obj4

California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj4.index.name = 'state'
obj4

state
California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index.name= 'test_index'
obj

test_index
0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index = ['Bob', 'Steve', 'Jeff', "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [39]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year':[2000, 2001, 2002, 2001, 2002, 2003], 
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [60]:
# frame2 = pd.DataFrame(data, columns=['year','state','pop', 'debt'],
#                      index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2 = pd.DataFrame(data)

frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
frame2.loc['five']

year       2002
state    Nevada
pop         2.9
debt        NaN
Name: five, dtype: object

In [47]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [48]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [49]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [51]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [52]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio':{2000: 1.5, 2001:1.7, 2002: 3.6}}
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [70]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [55]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [56]:
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [63]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevda':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevda
2000   1.5    NaN
2001   1.7    2.4

In [71]:
frame3.index.name = 'year';frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [72]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [73]:
frame2.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Nevada', 2003, 3.2]], dtype=object)

In [74]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [75]:
obj

a    0
b    1
c    2
dtype: int64

In [76]:
index[1:]

Index(['b', 'c'], dtype='object')

In [80]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [82]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [85]:
obj2.index is labels

True

In [86]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [87]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [88]:
'Ohio' in frame3.columns

True

In [93]:
2002 in frame3.index

True

In [94]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [95]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [96]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [97]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [98]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [100]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), 
                    index = ['a', 'c','d'],
                    columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [101]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [103]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [104]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [105]:
new_obj = obj.drop(['c'])
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [106]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [107]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
data.drop('two', axis =1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [111]:
data.drop('two',axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [112]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [113]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [114]:
obj['b']

1.0

In [115]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [117]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [118]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [119]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

In [120]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [124]:
obj['b':'c'] = 5

In [125]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [129]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [132]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [133]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [134]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
type(data[['one']])

pandas.core.frame.DataFrame

In [138]:
type(data['one'])

pandas.core.series.Series

In [139]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [141]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [143]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [144]:
data.iloc[2,[3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [145]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [146]:
data.iloc[[1,2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [147]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [149]:
data.iloc[:,:3][data.three >5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [150]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [162]:
data.iat[1,2] +3

9

In [164]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [167]:
ser[:-1]

0    0.0
1    1.0
dtype: float64

In [168]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [169]:
ser.iloc[:1]

0    0.0
dtype: float64

In [170]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [171]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [172]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [173]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [174]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [175]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [176]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1

   A
0  1
1  2

In [177]:
df2

   B
0  3
1  4

In [178]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [179]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [180]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [181]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [182]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [184]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [185]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [186]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [187]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [193]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [194]:
arr[0]

array([0., 1., 2., 3.])

In [195]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [197]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [198]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [199]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [201]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
print(series2)
frame + series2

b    0
e    1
f    2
dtype: int64

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [202]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [203]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [204]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [206]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.613188 -1.907271 -0.281903
Ohio   -0.414301  0.310729 -0.619042
Texas   0.724936 -2.653074  0.505268
Oregon -0.788806 -1.618290  0.772936

In [207]:
np.abs(frame)

               b         d         e
Utah    0.613188  1.907271  0.281903
Ohio    0.414301  0.310729  0.619042
Texas   0.724936  2.653074  0.505268
Oregon  0.788806  1.618290  0.772936

In [208]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.513741
d    2.963803
e    1.391978
dtype: float64

In [209]:
frame.apply(f, axis = 1)

Utah      2.520459
Ohio      0.929771
Texas     3.378009
Oregon    2.391227
dtype: float64

In [210]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.788806 -2.653074 -0.619042
max  0.724936  0.310729  0.772936

In [211]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.61  -1.91  -0.28
Ohio    -0.41   0.31  -0.62
Texas    0.72  -2.65   0.51
Oregon  -0.79  -1.62   0.77

In [213]:
frame['e'].map(format)

Utah      -0.28
Ohio      -0.62
Texas      0.51
Oregon     0.77
Name: e, dtype: object

In [216]:
obj = pd.Series(range(4),  index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [217]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [218]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [219]:
frame.sort_index(axis = 1).sort_index()

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [220]:
frame.sort_index(axis = 0, ascending= False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [221]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [222]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 1])
obj.sort_values()

4   -3.0
5    1.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [223]:
obj.sort_values(ascending=False)

2    7.0
0    4.0
5    1.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [224]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [225]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [226]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [229]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [231]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [233]:
obj.rank(ascending=False, method='min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [234]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                     'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [235]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [236]:
obj = pd.Series(range(5), index=['a', 'b', 'a', 'b', 'c'])
obj

a    0
b    1
a    2
b    3
c    4
dtype: int64

In [239]:
obj.index.is_unique

False

In [240]:
obj['a']

a    0
a    2
dtype: int64

In [241]:
df = pd.DataFrame(np.random.randn(4, 3), index = ['a', 'b', 'b', 'a'])
df

          0         1         2
a  0.367391  0.113944 -1.799698
b  0.015123  0.197335 -0.115914
b -0.273366 -2.081452  1.587513
a -1.190359  0.125011 -0.154873

In [242]:
df.loc['b']

          0         1         2
b  0.015123  0.197335 -0.115914
b -0.273366 -2.081452  1.587513

In [243]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [244]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [252]:
df.sum(axis='columns',skipna=True)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [251]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [255]:
df.idxmax()

one    b
two    d
dtype: object

In [257]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [258]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [259]:
obj = pd.Series(['a', 'a', 'b', 'c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [260]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [261]:
df.mad()

one    2.677778
two    1.600000
dtype: float64

In [262]:
df.prod()

one    7.455
two    5.850
dtype: float64

In [263]:
df.var()

one    12.205833
two     5.120000
dtype: float64

In [264]:
df.std()

one    3.493685
two    2.262742
dtype: float64

In [265]:
df.cummin()

    one  two
a  1.40  NaN
b  1.40 -4.5
c   NaN  NaN
d  0.75 -4.5

In [266]:
df.cumprod()

     one   two
a  1.400   NaN
b  9.940 -4.50
c    NaN   NaN
d  7.455  5.85

In [269]:
import pandas_datareader.data as web

In [271]:
web.get_data_yahoo(['AAPL', 'IBM', 'MSFT', 'GOOG'])

Attributes        High                                              Low  \
Symbols           AAPL         GOOG         IBM        MSFT        AAPL
Date
2009-12-31   30.478571   310.679321  132.850006   30.990000   30.080000
2010-01-04   30.642857   312.721039  132.970001   31.100000   30.340000
2010-01-05   30.798571   311.891449  131.850006   31.100000   30.464285
2010-01-06   30.747143   310.907837  131.490005   31.080000   30.107143
2010-01-07   30.285715   303.029083  130.250000   30.700001   29.864286
2010-01-08   30.285715   299.675903  130.919998   30.879999   29.865715
2010-01-11   30.428572   300.276978  131.059998   30.760000   29.778572
2010-01-12   29.967142   297.147339  131.330002   30.400000   29.488571
2010-01-13   30.132856   292.288940  131.119995   30.520000   29.157143
2010-01-14   30.065714   295.180145  132.710007   31.100000   29.860001
2010-01-15   30.228571   294.862213  132.889999   31.240000   29.410000
2010-01-19   30.741428   293.302338  134.250000   31.240000   29.605715
2010-01-20   30.792856   291.096710  131.149994   30.940001   29.928572
2010-01-21   30.472857   291.513977  130.690002   30.719999   29.601429
2010-01-22   29.642857   283.456390  128.889999   30.200001   28.165714
2010-01-25   29.242857   273.163330  126.889999   29.660000   28.598572
2010-01-26   30.530001   273.024231  127.750000   29.850000   28.940001
2010-01-27   30.082857   272.055542  126.959999   29.820000   28.504286
2010-01-28   29.357143   271.732635  127.040001   29.870001   28.385714
2010-01-29   28.885714   268.747070  125.000000   29.920000   27.178572
2010-02-01   28.000000   266.173798  124.949997   28.480000   27.328571
2010-02-02   28.045713   265.751556  125.809998   28.500000   27.625713
2010-02-03   28.600000   269.298462  126.070000   28.790001   27.774286
2010-02-04   28.338572   267.261719  125.440002   28.500000   27.367144
2010-02-05   28.000000   265.026245  123.720001   28.280001   27.264286
2010-02-08   28.268572   269.248810  123.220001   28.080000   27.714285
2010-02-09   28.214285   269.015320  124.199997   28.340000   27.821428
2010-02-10   28.085714   267.157410  123.650002   28.240000   27.751429
2010-02-11   28.535715   268.498688  124.199997   28.400000   27.722857
2010-02-12   28.805714   266.839478  124.050003   28.059999   27.928572
...                ...          ...         ...         ...         ...
2019-05-13  189.479996  1147.939941  133.570007  125.550003  182.850006
2019-05-14  189.699997  1140.420044  134.320007  125.879997  185.410004
2019-05-15  191.750000  1171.329956  134.589996  126.709999  186.020004
2019-05-16  192.470001  1188.160034  136.110001  129.380005  188.839996
2019-05-17  190.899994  1180.150024  135.410004  130.460007  186.759995
2019-05-20  184.350006  1146.796997  135.429993  127.589996  180.279999
2019-05-21  188.000000  1152.708008  137.059998  127.529999  184.699997
2019-05-22  185.710007  1158.520020  136.750000  128.240005  182.550003
2019-05-23  180.539993  1145.973022  135.130005  126.290001  177.809998
2019-05-24  182.139999  1149.765015  134.250000  127.419998  178.619995
2019-05-28  180.589996  1151.587036  132.639999  128.000000  177.910004
2019-05-29  179.350006  1129.099976  130.279999  125.389999  176.000000
2019-05-30  179.229996  1123.130005  129.970001  125.760002  176.669998
2019-05-31  177.990005  1109.599976  128.440002  124.620003  174.990005
2019-06-03  177.919998  1065.500000  128.559998  124.370003  170.270004
2019-06-04  179.830002  1056.050049  132.740005  123.279999  174.520004
2019-06-05  184.990005  1053.550049  133.610001  125.870003  181.139999
2019-06-06  185.470001  1047.489990  132.649994  127.970001  182.149994
2019-06-07  191.919998  1070.920044  134.720001  132.250000  185.770004
2019-06-10  195.369995  1092.660034  135.350006  134.080002  191.619995
2019-06-11  196.000000  1101.989990  136.460007  134.240005  193.600006
2019-06-12  195.970001  1080.930054  135.940002  131.970001  193.389999
2019-06-13  196.789993  1094.170044  136.270004  133.000000  193.600006
2019-06-14  193.589996  1092.689941  135.880005  133.789993  190.300003
2019-06-17  194.960007  1099.180054  136.029999  133.729996  192.169998
2019-06-18  200.289993  1116.390015  137.190002  135.240005  195.210007
2019-06-19  199.880005  1107.000000  138.360001  135.929993  197.309998
2019-06-20  200.610001  1120.119995  139.539993  137.660004  198.029999
2019-06-21  200.850006  1124.109985  139.539993  137.729996  198.149994
2019-06-24  200.160004  1122.000000  140.149994  138.399994  198.169998

Attributes                                             Open               ...  \
Symbols            GOOG         IBM        MSFT        AAPL         GOOG  ...
Date                                                                      ...
2009-12-31   307.986847  130.750000   30.480000   30.447144   310.356445  ...
2010-01-04   310.103088  130.850006   30.590000   30.490000   311.449310  ...
2010-01-05   308.761810  130.100006   30.639999   30.657143   311.563568  ...
2010-01-06   301.220856  129.809998   30.520000   30.625713   310.907837  ...
2010-01-07   294.410156  128.910004   30.190001   30.250000   302.731018  ...
2010-01-08   292.651581  129.050003   30.240000   30.042856   294.087250  ...
2010-01-11   295.100647  128.669998   30.120001   30.400000   300.276978  ...
2010-01-12   292.100159  129.000000   29.910000   29.884285   296.893982  ...
2010-01-13   285.095734  129.160004   30.010000   29.695715   286.382355  ...
2010-01-14   289.521942  129.910004   30.260000   30.015715   290.063416  ...
2010-01-15   287.152344  131.089996   30.709999   30.132856   294.752930  ...
2010-01-19   286.283020  131.559998   30.680000   29.761429   288.722137  ...
2010-01-20   285.786224  128.949997   30.309999   30.701429   291.096710  ...
2010-01-21   284.276062  128.059998   30.000000   30.297142   289.834900  ...
2010-01-22   265.701874  125.370003   28.840000   29.540001   280.426086  ...
2010-01-25   266.024780  125.709999   29.100000   28.930000   271.528961  ...
2010-01-26   266.412231  125.410004   29.090000   29.421429   267.246826  ...
2010-01-27   265.925415  125.040001   29.020000   29.549999   268.886169  ...
2010-01-28   263.585632  123.050003   28.889999   29.275715   270.485748  ...
2010-01-29   261.106750  121.900002   27.660000   28.725714   267.505127  ...
2010-02-01   263.436584  122.779999   27.920000   27.481428   265.572693  ...
2010-02-02   262.100281  123.949997   28.139999   27.987143   265.751556  ...
2010-02-03   262.408295  125.070000   28.120001   27.881428   262.626862  ...
2010-02-04   261.081909  122.900002   27.809999   28.104286   266.764954  ...
2010-02-05   259.541931  121.830002   27.570000   27.518572   262.492737  ...
2010-02-08   264.047638  121.739998   27.570000   27.955715   264.529480  ...
2010-02-09   265.806183  122.459999   27.750000   28.059999   268.026733  ...
2010-02-10   262.140045  122.209999   27.840000   27.984285   265.309418  ...
2010-02-11   263.039185  122.059998   27.700001   27.840000   264.936829  ...
2010-02-12   263.535950  121.610001   27.580000   28.301428   264.762970  ...
...                 ...         ...         ...         ...          ...  ...
2019-05-13  1122.109985  130.960007  123.040001  187.710007  1141.959961  ...
2019-05-14  1119.550049  131.679993  123.699997  186.410004  1137.209961  ...
2019-05-15  1116.666016  132.369995  123.699997  186.270004  1117.869995  ...
2019-05-16  1162.839966  134.639999  126.459999  189.910004  1164.510010  ...
2019-05-17  1160.010010  133.940002  127.919998  186.929993  1168.469971  ...
2019-05-20  1131.442993  132.929993  125.760002  183.520004  1144.500000  ...
2019-05-21  1137.939941  135.789993  126.580002  185.220001  1148.489990  ...
2019-05-22  1145.890015  135.710007  126.519997  184.660004  1146.750000  ...
2019-05-23  1129.223999  130.440002  124.739998  179.800003  1140.500000  ...
2019-05-24  1131.660034  131.589996  125.970001  180.199997  1147.359985  ...
2019-05-28  1133.119995  130.270004  126.050003  178.919998  1134.000000  ...
2019-05-29  1108.219971  128.320007  124.040001  176.419998  1127.520020  ...
2019-05-30  1112.119995  128.929993  124.779999  177.949997  1115.540039  ...
2019-05-31  1100.180054  126.849998  123.320000  176.229996  1101.290039  ...
2019-06-03  1025.000000  127.059998  119.010002  175.600006  1065.500000  ...
2019-06-04  1033.689941  129.089996  120.650002  175.440002  1042.900024  ...
2019-06-05  1030.489990  130.470001  124.209999  184.279999  1051.540039  ...
2019-06-06  1033.699951  130.899994  125.599998  183.080002  1044.989990  ...
2019-06-07  1048.400024  132.210007  128.259995  186.509995  1050.630005  ...
2019-06-10  1072.322021  133.910004  132.000000  191.809998  1072.979980  ...
2019-06-11  1077.603027  135.050003  131.279999  194.860001  1093.979980  ...
2019-06-12  1067.540039  134.410004  130.710007  193.949997  1078.000000  ...
2019-06-13  1080.150024  135.089996  131.559998  194.699997  1083.640015  ...
2019-06-14  1080.171997  134.429993  131.639999  191.550003  1086.420044  ...
2019-06-17  1086.280029  134.699997  132.529999  192.899994  1086.280029  ...
2019-06-18  1098.989990  135.199997  133.570007  196.050003  1109.689941  ...
2019-06-19  1093.479980  136.240005  133.809998  199.679993  1105.599976  ...
2019-06-20  1104.739990  138.199997  135.720001  200.369995  1119.989990  ...
2019-06-21  1108.079956  138.389999  136.460007  198.800003  1109.239990  ...
2019-06-24  1111.010010  139.050003  137.000000  198.539993  1119.609985  ...

Attributes       Close                   Volume                          \
Symbols            IBM        MSFT         AAPL        GOOG         IBM
Date
2009-12-31  130.899994   30.480000   88102700.0   2455400.0   4223400.0
2010-01-04  132.449997   30.950001  123432400.0   3937800.0   6155300.0
2010-01-05  130.850006   30.959999  150476200.0   6048500.0   6841400.0
2010-01-06  130.000000   30.770000  138040000.0   8009000.0   5605300.0
2010-01-07  129.550003   30.450001  119282800.0  12912000.0   5840600.0
2010-01-08  130.850006   30.660000  111902700.0   9509900.0   4197200.0
2010-01-11  129.479996   30.270000  115557400.0  14519600.0   5730400.0
2010-01-12  130.509995   30.070000  148614900.0   9769600.0   8081500.0
2010-01-13  130.229996   30.350000  151473000.0  13077600.0   6455400.0
2010-01-14  132.309998   30.959999  108223500.0   8535300.0   7111800.0
2010-01-15  131.779999   30.860001  148516900.0  10939600.0   8494400.0
2010-01-19  134.139999   31.100000  182501900.0   8689500.0  13916200.0
2010-01-20  130.250000   30.590000  153038200.0   6543600.0  15197500.0
2010-01-21  129.000000   30.010000  152038600.0  12697400.0   9608600.0
2010-01-22  125.500000   28.959999  220441900.0  13689200.0  10088600.0
2010-01-25  126.120003   29.320000  266424900.0   8897200.0   5738500.0
2010-01-26  125.750000   29.500000  466777500.0   8767600.0   7135300.0
2010-01-27  126.330002   29.670000  430642100.0   7980200.0   8719200.0
2010-01-28  123.750000   29.160000  293375600.0   6500100.0   9622200.0
2010-01-29  122.389999   28.180000  311488100.0   8334700.0  11571200.0
2010-02-01  124.669998   28.410000  187469100.0   4530800.0   7242900.0
2010-02-02  125.529999   28.459999  174585600.0   8245600.0   5899900.0
2010-02-03  125.660004   28.629999  153832000.0   6037000.0   4177100.0
2010-02-04  123.000000   27.840000  189413000.0   6799200.0   9126900.0
2010-02-05  123.519997   28.020000  212576700.0   6353000.0   8617000.0
2010-02-08  121.879997   27.719999  119567700.0   5423500.0   5718500.0
2010-02-09  123.209999   28.010000  158221700.0   5675700.0   6044500.0
2010-02-10  122.809998   27.990000   92590400.0   5383700.0   5219100.0
2010-02-11  123.730003   28.120001  137586400.0   4851300.0   5089000.0
2010-02-12  124.000000   27.930000  163867200.0   4589000.0   8017700.0
...                ...         ...          ...         ...         ...
2019-05-13  131.419998  123.349998   57430600.0   1860600.0   4958000.0
2019-05-14  133.309998  124.730003   36529700.0   1836600.0   3280400.0
2019-05-15  134.399994  126.019997   26544700.0   2289300.0   2551000.0
2019-05-16  135.880005  128.929993   33031400.0   1531400.0   3017300.0
2019-05-17  134.320007  128.070007   32879100.0   1208600.0   2619100.0
2019-05-20  135.119995  126.220001   38612300.0   1353300.0   3264500.0
2019-05-21  136.449997  126.900002   28364800.0   1159800.0   2503500.0
2019-05-22  136.350006  127.669998   29748600.0    914500.0   1849800.0
2019-05-23  132.389999  126.180000   36529700.0   1198900.0   5343400.0
2019-05-24  132.279999  126.239998   23714700.0   1112000.0   2596100.0
2019-05-28  130.460007  126.160004   27948200.0   1365000.0   4908800.0
2019-05-29  129.690002  124.940002   28481200.0   1538200.0   3679000.0
2019-05-30  129.570007  125.730003   21218400.0    951900.0   2741900.0
2019-05-31  126.989998  123.680000   27043600.0   1507800.0   3539300.0
2019-06-03  128.270004  119.839996   40396100.0   5130600.0   4266900.0
2019-06-04  132.690002  123.160004   30968000.0   2833500.0   3913500.0
2019-06-05  131.490005  125.830002   29773400.0   2168400.0   3161300.0
2019-06-06  132.220001  127.820000   22526300.0   1703200.0   2298200.0
2019-06-07  133.309998  131.399994   30684400.0   1802400.0   2553400.0
2019-06-10  134.740005  132.600006   26220900.0   1464200.0   2911300.0
2019-06-11  135.949997  132.100006   26932900.0   1436700.0   3407300.0
2019-06-12  134.869995  131.490005   18253200.0   1061000.0   2254700.0
2019-06-13  135.759995  132.320007   21674600.0   1057700.0   2955300.0
2019-06-14  135.149994  132.449997   18761500.0   1111500.0   2193300.0
2019-06-17  134.949997  132.850006   14669100.0    941600.0   2194100.0
2019-06-18  136.380005  135.160004   26551000.0   1386700.0   2914700.0
2019-06-19  137.080002  135.690002   21124200.0   1338800.0   2382400.0
2019-06-20  138.850006  136.949997   21514000.0   1262000.0   3071000.0
2019-06-21  139.199997  136.970001   47800600.0   1947600.0   5288700.0
2019-06-24  139.350006  137.779999   18205500.0   1395600.0   2186000.0

Attributes                Adj Close
Symbols            MSFT        AAPL         GOOG         IBM        MSFT
Date
2009-12-31   31929700.0   19.996618   307.986847   98.137283   24.152580
2010-01-04   38409100.0   20.307869   311.349976   99.299347   24.525019
2010-01-05   49749600.0   20.342979   309.978882   98.099792   24.532942
2010-01-06   58182400.0   20.019398   302.164703   97.462532   24.382378
2010-01-07   50559700.0   19.982389   295.130463   97.125160   24.128809
2010-01-08   51197400.0   20.115240   299.064880   98.099792   24.295214
2010-01-11   68754700.0   19.937790   298.612823   97.072685   23.986179
2010-01-12   65912100.0   19.710993   293.332153   97.844872   23.827694
2010-01-13   51863500.0   19.989031   291.648102   97.634964   24.049570
2010-01-14   63228100.0   19.873259   293.019196   99.194389   24.532942
2010-01-15   79913200.0   19.541140   288.126007   98.797028   24.453693
2010-01-19   46575700.0   20.405605   291.911407  100.566330   24.643881
2010-01-20   54849500.0   20.091518   288.329681   97.649979   24.239746
2010-01-21   73086700.0   19.744209   289.606384   96.712860   23.780155
2010-01-22  102004600.0   18.764919   273.227905   94.088844   22.948128
2010-01-25   63373000.0   19.269749   268.255249   94.553688   23.233395
2010-01-26   66639900.0   19.542088   269.457428   94.276276   23.376024
2010-01-27   63949500.0   19.726181   269.298462   94.711105   23.510740
2010-01-28  117513700.0   18.911057   265.418701   92.776848   23.106604
2010-01-29  193888500.0   18.224987   263.257751   91.757233   22.330048
2010-02-01   85931100.0   18.478348   264.787811   93.466576   22.512297
2010-02-02   54413700.0   18.585581   263.843964   94.111336   22.551926
2010-02-03   61397900.0   18.905357   268.662598   94.208817   22.686628
2010-02-04   77850000.0   18.224039   261.687958   92.214569   22.060629
2010-02-05   80960100.0   18.547623   263.928406   92.604401   22.203266
2010-02-08   52820600.0   18.420462   265.011353   91.783577   21.965540
2010-02-09   59195800.0   18.616892   266.486755   92.785126   22.195339
2010-02-10   48591300.0   18.515354   265.498199   92.483902   22.179491
2010-02-11   65993700.0   18.852224   266.466888   93.176750   22.282507
2010-02-12   81117200.0   19.014488   264.837494   93.380051   22.131947
...                 ...         ...          ...         ...         ...
2019-05-13   33944900.0  185.720001  1132.030029  131.419998  122.895088
2019-05-14   25266300.0  188.660004  1120.439941  133.309998  124.270004
2019-05-15   24722700.0  190.919998  1164.209961  134.399994  126.019997
2019-05-16   30112200.0  190.080002  1178.979980  135.880005  128.929993
2019-05-17   25770500.0  189.000000  1162.300049  134.320007  128.070007
2019-05-20   23706900.0  183.089996  1138.849976  135.119995  126.220001
2019-05-21   15293300.0  186.600006  1149.630005  136.449997  126.900002
2019-05-22   15396500.0  182.779999  1151.420044  136.350006  127.669998
2019-05-23   23603800.0  179.660004  1140.770020  132.389999  126.180000
2019-05-24   14123400.0  178.970001  1133.469971  132.279999  126.239998
2019-05-28   23128400.0  178.229996  1134.150024  130.460007  126.160004
2019-05-29   22763100.0  177.380005  1116.459961  129.690002  124.940002
2019-05-30   16829600.0  178.300003  1117.949951  129.570007  125.730003
2019-05-31   26646800.0  175.070007  1103.630005  126.989998  123.680000
2019-06-03   37983600.0  173.300003  1036.229980  128.270004  119.839996
2019-06-04   29382600.0  179.639999  1053.050049  132.690002  123.160004
2019-06-05   24926100.0  182.539993  1042.219971  131.490005  125.830002
2019-06-06   21459000.0  185.220001  1044.339966  132.220001  127.820000
2019-06-07   33885600.0  190.149994  1066.040039  133.309998  131.399994
2019-06-10   26477100.0  192.580002  1080.380005  134.740005  132.600006
2019-06-11   23913700.0  194.809998  1078.719971  135.949997  132.100006
2019-06-12   17092500.0  194.190002  1077.030029  134.869995  131.490005
2019-06-13   17200800.0  194.149994  1088.770020  135.759995  132.320007
2019-06-14   17821700.0  192.740005  1085.349976  135.149994  132.449997
2019-06-17   14517800.0  193.889999  1092.500000  134.949997  132.850006
2019-06-18   25934500.0  198.449997  1103.599976  136.380005  135.160004
2019-06-19   23744400.0  197.869995  1102.329956  137.080002  135.690002
2019-06-20   33042600.0  199.460007  1111.420044  138.850006  136.949997
2019-06-21   36727900.0  198.779999  1121.880005  139.199997  136.970001
2019-06-24   20619300.0  198.580002  1115.520020  139.350006  137.779999

[2385 rows x 24 columns]

In [272]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [273]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [275]:
volume

                   AAPL         IBM         MSFT        GOOG
Date
2009-12-31   88102700.0   4223400.0   31929700.0   2455400.0
2010-01-04  123432400.0   6155300.0   38409100.0   3937800.0
2010-01-05  150476200.0   6841400.0   49749600.0   6048500.0
2010-01-06  138040000.0   5605300.0   58182400.0   8009000.0
2010-01-07  119282800.0   5840600.0   50559700.0  12912000.0
2010-01-08  111902700.0   4197200.0   51197400.0   9509900.0
2010-01-11  115557400.0   5730400.0   68754700.0  14519600.0
2010-01-12  148614900.0   8081500.0   65912100.0   9769600.0
2010-01-13  151473000.0   6455400.0   51863500.0  13077600.0
2010-01-14  108223500.0   7111800.0   63228100.0   8535300.0
2010-01-15  148516900.0   8494400.0   79913200.0  10939600.0
2010-01-19  182501900.0  13916200.0   46575700.0   8689500.0
2010-01-20  153038200.0  15197500.0   54849500.0   6543600.0
2010-01-21  152038600.0   9608600.0   73086700.0  12697400.0
2010-01-22  220441900.0  10088600.0  102004600.0  13689200.0
2010-01-25  266424900.0   5738500.0   63373000.0   8897200.0
2010-01-26  466777500.0   7135300.0   66639900.0   8767600.0
2010-01-27  430642100.0   8719200.0   63949500.0   7980200.0
2010-01-28  293375600.0   9622200.0  117513700.0   6500100.0
2010-01-29  311488100.0  11571200.0  193888500.0   8334700.0
2010-02-01  187469100.0   7242900.0   85931100.0   4530800.0
2010-02-02  174585600.0   5899900.0   54413700.0   8245600.0
2010-02-03  153832000.0   4177100.0   61397900.0   6037000.0
2010-02-04  189413000.0   9126900.0   77850000.0   6799200.0
2010-02-05  212576700.0   8617000.0   80960100.0   6353000.0
2010-02-08  119567700.0   5718500.0   52820600.0   5423500.0
2010-02-09  158221700.0   6044500.0   59195800.0   5675700.0
2010-02-10   92590400.0   5219100.0   48591300.0   5383700.0
2010-02-11  137586400.0   5089000.0   65993700.0   4851300.0
2010-02-12  163867200.0   8017700.0   81117200.0   4589000.0
...                 ...         ...          ...         ...
2019-05-13   57430600.0   4958000.0   33944900.0   1860600.0
2019-05-14   36529700.0   3280400.0   25266300.0   1836600.0
2019-05-15   26544700.0   2551000.0   24722700.0   2289300.0
2019-05-16   33031400.0   3017300.0   30112200.0   1531400.0
2019-05-17   32879100.0   2619100.0   25770500.0   1208600.0
2019-05-20   38612300.0   3264500.0   23706900.0   1353300.0
2019-05-21   28364800.0   2503500.0   15293300.0   1159800.0
2019-05-22   29748600.0   1849800.0   15396500.0    914500.0
2019-05-23   36529700.0   5343400.0   23603800.0   1198900.0
2019-05-24   23714700.0   2596100.0   14123400.0   1112000.0
2019-05-28   27948200.0   4908800.0   23128400.0   1365000.0
2019-05-29   28481200.0   3679000.0   22763100.0   1538200.0
2019-05-30   21218400.0   2741900.0   16829600.0    951900.0
2019-05-31   27043600.0   3539300.0   26646800.0   1507800.0
2019-06-03   40396100.0   4266900.0   37983600.0   5130600.0
2019-06-04   30968000.0   3913500.0   29382600.0   2833500.0
2019-06-05   29773400.0   3161300.0   24926100.0   2168400.0
2019-06-06   22526300.0   2298200.0   21459000.0   1703200.0
2019-06-07   30684400.0   2553400.0   33885600.0   1802400.0
2019-06-10   26220900.0   2911300.0   26477100.0   1464200.0
2019-06-11   26932900.0   3407300.0   23913700.0   1436700.0
2019-06-12   18253200.0   2254700.0   17092500.0   1061000.0
2019-06-13   21674600.0   2955300.0   17200800.0   1057700.0
2019-06-14   18761500.0   2193300.0   17821700.0   1111500.0
2019-06-17   14669100.0   2194100.0   14517800.0    941600.0
2019-06-18   26551000.0   2914700.0   25934500.0   1386700.0
2019-06-19   21124200.0   2382400.0   23744400.0   1338800.0
2019-06-20   21514000.0   3071000.0   33042600.0   1262000.0
2019-06-21   47800600.0   5288700.0   36727900.0   1947600.0
2019-06-24   18205500.0   2186000.0   20619300.0   1395600.0

[2385 rows x 4 columns]

In [276]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-06-18  0.023518  0.010597  0.017388  0.010160
2019-06-19 -0.002923  0.005133  0.003921 -0.001151
2019-06-20  0.008036  0.012912  0.009286  0.008246
2019-06-21 -0.003409  0.002521  0.000146  0.009411
2019-06-24 -0.001006  0.001078  0.005914 -0.005669

In [277]:
returns['MSFT'].corr(returns['IBM'])

0.4870475619991644

In [278]:
returns['MSFT'].cov(returns['IBM'])

8.674425220966523e-05

In [281]:
returns.MSFT.corr(returns.IBM)

0.4870475619991644

In [282]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.379235  0.452733  0.460781
IBM   0.379235  1.000000  0.487048  0.402964
MSFT  0.452733  0.487048  1.000000  0.537304
GOOG  0.460781  0.402964  0.537304  1.000000

In [283]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000266  0.000076  0.000107  0.000116
IBM   0.000076  0.000152  0.000087  0.000077
MSFT  0.000107  0.000087  0.000209  0.000120
GOOG  0.000116  0.000077  0.000120  0.000239

In [284]:
returns.corrwith(returns.IBM)

AAPL    0.379235
IBM     1.000000
MSFT    0.487048
GOOG    0.402964
dtype: float64

In [285]:
returns.corrwith(volume)

AAPL   -0.062365
IBM    -0.156340
MSFT   -0.090440
GOOG   -0.020999
dtype: float64

In [286]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [287]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [288]:
obj.value_counts(sort=True)

c    3
a    3
b    2
d    1
dtype: int64

In [289]:
pd.value_counts(obj.values, sort=False)

d    1
a    3
c    3
b    2
dtype: int64

In [290]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [291]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [292]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [293]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [294]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [296]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0